{
  "backend/main.mo": "IC backend actor handling admin auth, token sessions, default admin bootstrap, and order/user profile storage.",
  "feature_evidence.json": "Feature evidence report mapping admin‑auth stability requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Collected summaries of numerous frontend files describing their roles in UI, admin flows, hooks, and styling.",
  "frontend/index.css": "Tailwind-based global theme defining light/dark OKLCH color variables and base styling rules.",
  "frontend/index.html": "HTML entry point with SEO metadata, OG/Twitter tags, Inter font, and root mount point.",
  "frontend/src/App.tsx": "Root React component switching between home and admin views and managing the order dialog state.",
  "frontend/src/components/admin/AdminBootstrap.tsx": "UI for initial admin‑account creation with credential display, copy actions, and bootstrap flow handling.",
  "frontend/src/components/admin/AdminGate.tsx": "Gate component that decides between bootstrap, login, or authenticated admin views based on session and setup state.",
  "frontend/src/components/admin/AdminLogin.tsx": "Admin login form handling email/password authentication with validation and error display.",
  "frontend/src/components/admin/OrdersAdmin.tsx": "Admin dashboard for viewing, filtering, downloading, and deleting orders with dialogs and status handling.",
  "frontend/src/components/admin/PricingAdminEditor.tsx": "Empty file placeholder for an admin pricing editor component.",
  "frontend/src/components/auth/AccessDenied.tsx": "Displays an access denied message with optional return-to-login button.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and session clearing.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing company info, contact details, social links, and attribution.",
  "frontend/src/components/layout/Header.tsx": "Responsive site header with navigation links and mobile menu toggle.",
  "frontend/src/components/order/OrderDialog.tsx": "Dialog for placing orders and showing post‑submission success state with order reference.",
  "frontend/src/components/order/OrderForm.tsx": "Order submission form handling service selection, user details, optional file upload, and mutation call.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders a simple About section describing the agency and its mission.",
  "frontend/src/components/sections/ContactSection.tsx": "Displays contact details including founder, location, and email inside a card layout.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with background image, headline text, and buttons that trigger scroll or order actions.",
  "frontend/src/components/sections/PortfolioSection.tsx": "Shows a grid of predefined portfolio items with icons and descriptions.",
  "frontend/src/components/sections/PricingSection.tsx": "Empty placeholder file for a future pricing section.",
  "frontend/src/components/sections/ServicesSection.tsx": "Lists services from serviceCatalog and provides order buttons, supporting scroll reference forwarding.",
  "frontend/src/components/sections/WhyChooseUsSection.tsx": "Displays reasons to choose the agency using icon cards with titles and descriptions.",
  "frontend/src/components/services/serviceCatalog.ts": "Exports an array of service definitions including ids, titles, descriptions, and icons.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useAdminAuth.ts": "Provides admin login/logout logic using the actor and manages session state and errors.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Handles admin bootstrap flow including checking existence and creating a default admin.",
  "frontend/src/hooks/useAdminSession.ts": "Tracks and exposes admin session state using adminSession subscriptions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity state and login flow. Includes helper functions to create an AuthClient and expose login status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for creating, fetching, downloading, and deleting orders with admin token handling. Wraps actor calls with error normalization and session validation.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode styles, base typography, and utility animations. Establishes global design tokens and layout defaults.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider. Renders the root App component with global styles.",
  "frontend/src/pages/admin/AdminPage.tsx": "Admin dashboard page with logout, username display, and order management within an access gate. Includes navigation back to the main site.",
  "frontend/src/pages/HomePage.tsx": "Home page layout composing sections like hero, services, and contact with smooth scrolling and order dialog management. Passes navigation and dialog control props.",
  "frontend/src/utils/adminSession.ts": "Manages admin session data in sessionStorage with listeners, expiry handling, and helpers for token and username retrieval. Provides set, clear, and subscribe functions.",
  "frontend/src/utils/adminTokenError.ts": "Detects explicit admin token authentication errors by matching known backend error messages. Used to identify invalid or expired sessions.",
  "frontend/src/utils/fileToBytes.ts": "Converts a File or Blob into a Uint8Array using FileReader. Supports file uploads to the backend.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters, including hash-based routing support and session-backed storage. Helps manage tokens and other transient URL data.",
  "frontend/src/utils/userFacingError.ts": "Normalizes unknown errors to safe English-only messages with mappings for common cases and strips emojis as a fallback.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, extended color system, animations, and plugins like typography and container queries.",
  "project_state.json": "Project metadata tracking scope, architectural notes, known issues, and feature definitions for the PIXEL NOVA DIGITALS site."
}