{
  "backend/main.mo": "Motoko backend defining user profiles, app content, contact info, products, orders, and admin data with access-control‑protected CRUD methods.",
  "feature_evidence.json": "Feature evidence report listing implemented features, affected files, components, and related tests.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files for reference in build planning.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables, dark mode, and base element styling.",
  "frontend/index.html": "HTML entry point with meta tags, OG/Twitter SEO data, fonts, and root mount for the app.",
  "frontend/src/App.tsx": "Top-level React component toggling between home and admin views and managing order dialog state.",
  "frontend/src/components/admin/AdminBootstrap.tsx": "Deprecated admin setup screen showing bootstrap status and messages despite no longer being required.",
  "frontend/src/components/admin/AdminGate.tsx": "Wrapper component that now simply renders children because admin access is public.",
  "frontend/src/components/admin/AdminLogin.tsx": "Deprecated login UI retaining logic for admin auth and recovery, but marked as unnecessary due to public access.",
  "frontend/src/components/admin/BasicTextAdminEditor.tsx": "Admin form for editing SEO metadata and basic business info, loading existing content and saving updates.",
  "frontend/src/components/admin/ContactAdminEditor.tsx": "Admin editor for contact section fields with validation for required inputs and URL formats, supporting updates to backend data.",
  "frontend/src/components/admin/OrdersAdmin.tsx": "Admin interface to view, filter, download files from, and delete customer orders with dialogs and status handling.",
  "frontend/src/components/admin/PricingAdminEditor.tsx": "Empty placeholder file for pricing admin editor.",
  "frontend/src/components/admin/SocialLinksAdminEditor.tsx": "Admin form for editing social media URLs with validation and saving to app content.",
  "frontend/src/components/auth/AccessDenied.tsx": "UI component showing an access denied message with optional return-to-login button.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication states and query cache resets.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying business info, location, dynamic social links, and copyright with external attribution.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with navigation links, admin button, and mobile menu toggle.",
  "frontend/src/components/order/OrderDialog.tsx": "Dialog that displays an order form and shows a success screen with order ID after submission.",
  "frontend/src/components/order/OrderForm.tsx": "Order submission form with validation, file upload support, and integration with createOrder API.",
  "frontend/src/components/sections/AboutSection.tsx": "Static section describing the agency and its mission.",
  "frontend/src/components/sections/ContactSection.tsx": "Dynamic contact section loading contact info and displaying details with optional map embed.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with dynamic description, call‑to‑action buttons, and styled background.",
  "frontend/src/components/sections/PortfolioSection.tsx": "Displays predefined portfolio items with icons and descriptions in a grid layout.",
  "frontend/src/components/sections/PricingSection.tsx": "Empty placeholder file for future pricing section.",
  "frontend/src/components/sections/ServicesSection.tsx": "Renders service cards from serviceCatalog with order buttons and a section header.",
  "frontend/src/components/sections/WhyChooseUsSection.tsx": "Highlights reasons to choose the agency using icon‑based cards.",
  "frontend/src/components/services/serviceCatalog.ts": "Exports a list of service definitions with ids, titles, descriptions, and icon components.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching and invalidating queries when identity changes.",
  "frontend/src/hooks/useAdminAuth.ts": "Provides deprecated admin authentication logic including login, logout, token verification, and session handling.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Checks if an admin exists and optionally creates a default admin, exposing state for credentials and errors.",
  "frontend/src/hooks/useAdminBootstrapStatus.ts": "Determines backend admin capabilities, checks admin existence, and handles default admin creation with status tracking.",
  "frontend/src/hooks/useAdminSession.ts": "Tracks admin session state from storage and logs transitions, exposing username and token.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, identity loading, and status management using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Implements hooks for creating orders, retrieving orders, downloading files, and deleting orders through the backend actor.",
  "frontend/src/index.css": "Tailwind base setup defining CSS variables for themes and global typography plus a gradient animation utility.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, rendering App into root.",
  "frontend/src/pages/admin/AdminPage.tsx": "Admin panel with tabbed editors for orders, text, social links, and contact settings behind an admin gate.",
  "frontend/src/pages/HomePage.tsx": "Home page composing multiple sections with smooth scrolling and an order dialog.",
  "frontend/src/types/extended-backend.ts": "Extended backend TypeScript interfaces for contact info, orders, and admin-related methods with variant result types.",
  "frontend/src/utils/adminAuthDiagnostics.ts": "Diagnostic logger for admin auth events with deduplication and timed reset.",
  "frontend/src/utils/adminAuthResult.ts": "Normalizes various backend auth response formats into a consistent token/error result.",
  "frontend/src/utils/adminAuthVerification.ts": "Verifies admin tokens by calling a token-protected backend method and classifying failure reasons.",
  "frontend/src/utils/adminSession.ts": "Manages admin session storage with expiry handling, logout reasons, and listener notifications.",
  "frontend/src/utils/adminSetupRecovery.ts": "Classifies admin authentication errors into categories like not-setup, invalid credentials, or backend unavailable.",
  "frontend/src/utils/adminTokenError.ts": "Detects explicit backend invalid/expired admin token errors via message matching.",
  "frontend/src/utils/fileToBytes.ts": "Converts a File or Blob into a Uint8Array for backend uploads.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash-based), store/retrieve them in sessionStorage, and handle persisted parameter logic.",
  "frontend/src/utils/userFacingError.ts": "Normalizes various backend and validation errors into safe, user-friendly English messages.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, layout, animations, and enabling typography, container-queries, and animation plugins.",
  "project_state.json": "Defines current project state and feature requests focused on removing admin-panel authentication and access restrictions."
}