{
  "kind": "build_request",
  "title": "Make admin panel publicly accessible (no email/password, no token gating)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove all frontend authentication gating for the Admin Panel so that navigating to the Admin view always renders the admin dashboard without showing AdminLogin/AdminBootstrap screens.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Open admin panel for everyone"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the \"Admin\" button in the header immediately shows the admin dashboard tabs (Orders, Basic Text, Social Links, Contact Settings) without any login form.",
        "Refreshing the page while on the Admin view does not prompt for admin credentials and does not show \"Session expired\" errors."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update admin-related React Query hooks and admin UI flows to stop using admin session storage and token-based admin calls (e.g., getAllOrdersWithToken/deleteOrderWithToken/downloadFileWithToken/getOrderDetailWithToken), and instead call non-token backend methods that work for any visitor.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Open admin panel for everyone"
        ]
      },
      "acceptanceCriteria": [
        "Orders list loads successfully in the admin dashboard without requiring an admin token.",
        "Deleting an order and downloading/viewing order details works without an admin token.",
        "No admin-token invalidation logic triggers (no clearing session, no \"Session expired\" messages) during normal admin usage."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Remove backend access restrictions for the Admin Panel operations so they are callable by any principal, including: reading all orders, reading order details, deleting orders, downloading files, and updating site content/contact info.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Open admin panel for everyone"
        ]
      },
      "acceptanceCriteria": [
        "All admin dashboard operations succeed when called without any prior admin login (no Runtime.trap with \"Unauthorized\" or \"Invalid or expired admin session token\").",
        "Backend provides non-token methods for any admin-panel functionality currently only available via token-gated endpoints.",
        "Backend no longer requires email/password admin login for the admin dashboard to function."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Do not modify files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not add new authentication providers or third-party auth (Internet Identity-only remains as-is for the rest of the app).",
    "Do not implement role-based permissions or partial public access; the admin panel should be fully open as requested."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}