{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Publicly accessible admin panel (remove admin auth + token flows)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove all frontend authentication gating so the Admin view always renders the admin dashboard (no AdminLogin/AdminBootstrap screens).",
      "acceptanceCriteria": [
        "Clicking the \"Admin\" button in the header immediately shows the admin dashboard tabs (Orders, Basic Text, Social Links, Contact Settings) without any login form.",
        "Refreshing the page while on the Admin view does not prompt for admin credentials and does not show \"Session expired\" errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AdminGate.tsx",
          "operation": "modify",
          "description": "Replace the current gating/bootstrapping/login rendering logic with a simple pass-through wrapper that always renders children (and removes any dependency on admin session state, bootstrap status, and login/bootstrapping screens)."
        },
        {
          "path": "frontend/src/pages/admin/AdminPage.tsx",
          "operation": "modify",
          "description": "Remove admin-auth UI elements tied to session state (e.g., username display and Logout button) and stop importing/using useAdminAuth; keep the dashboard tabs and navigation intact while still rendering within AdminGate (now pass-through)."
        },
        {
          "path": "frontend/src/components/admin/AdminLogin.tsx",
          "operation": "modify",
          "description": "Mark this screen as deprecated/unreachable by public admin access: remove any navigation expectations and ensure it is not required by any admin flow (kept only as dead code until future cleanup)."
        },
        {
          "path": "frontend/src/components/admin/AdminBootstrap.tsx",
          "operation": "modify",
          "description": "Mark this screen as deprecated/unreachable by public admin access: ensure it is not required by any admin flow (kept only as dead code until future cleanup)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update admin React Query hooks and admin UI flows to stop using admin session storage and token-based admin calls; use non-token backend methods callable by any visitor and remove token invalidation/session-expired behavior.",
      "acceptanceCriteria": [
        "Orders list loads successfully in the admin dashboard without requiring an admin token.",
        "Deleting an order and downloading/viewing order details works without an admin token.",
        "No admin-token invalidation logic triggers (no clearing session, no \"Session expired\" messages) during normal admin usage."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Refactor admin-order hooks to remove all usage of adminSession, token retrieval, token error detection, and token invalidation side effects; call non-token backend capabilities for: loading orders, deleting orders, downloading files, and fetching order details (and if the non-token methods are not available, surface a clear 'backend update required' error without referencing sessions/tokens)."
        },
        {
          "path": "frontend/src/components/admin/OrdersAdmin.tsx",
          "operation": "modify",
          "description": "Ensure Orders admin UI relies only on the updated non-token hooks for listing, deleting, downloading, and (if added) viewing order details; remove/avoid any UI messaging about 'Session expired' and ensure refresh/retry behavior does not depend on admin tokens."
        },
        {
          "path": "frontend/src/types/extended-backend.ts",
          "operation": "modify",
          "description": "Update the ExtendedBackendInterface typing to include optional non-token admin-order methods (e.g., equivalents of getAllOrders/deleteOrder/downloadFile/getOrderDetail without token parameters) so hooks can call them safely with defensive existence checks."
        },
        {
          "path": "frontend/src/hooks/useAdminAuth.ts",
          "operation": "modify",
          "description": "Deprecate admin email/password login/logout behavior for the admin panel: remove reliance on adminSession storage and token verification flows so it is not needed for admin access (retain only what is still required elsewhere in the app, if anything)."
        },
        {
          "path": "frontend/src/hooks/useAdminSession.ts",
          "operation": "modify",
          "description": "Stop treating admin session presence as a prerequisite for rendering admin features; ensure no admin UI depends on this hook for access decisions (it may remain for legacy code but should not be required by admin page rendering)."
        },
        {
          "path": "frontend/src/utils/adminSession.ts",
          "operation": "modify",
          "description": "Remove or neutralize admin-session-specific behaviors that cause user-facing 'session expired' or forced-clearing flows during admin usage; ensure updated admin flows do not call into this module."
        }
      ]
    }
  ]
}